#### Create a dataset for 30 students

In [2]:
import pandas as pd

In [3]:
data = {
    "Name": ["Daniel", "Samuel", "Deborah", "Ronald", "Messi", "Bruno", "Rashy", "Martinez", "Light", "Love", "Emmanuel", "Divine", "Vincent", "Grace", "Glory", "Precious", "Priscilla", "Francisca", "Fred", "Progress", "Marvelous", "Shaw", "Dorgu", "Silva", "Daniella", "Emmanuella", "Gabriel", "Arnold", "Raya", "Yamal"],
    "Age": [15, 20, 23, 29, 18, 14, 16, 19, 30, 25, 24, 31, 34, 26, 10, 12, 17, 21, 35, 36, 40, 39, 38, 33, 9, 11,  44, 42, 41, 45],
    "Score": [67, 56, 54, 89, 91, 75, 46, 31, 34, 28, 47, 86, 59, 78, 94, 65, 85, 81, 79, 44, 41, 50, 60, 61, 77, 88, 95, 66, 82, 94]
    }
df = pd.DataFrame(data)
print(df)

          Name  Age  Score
0       Daniel   15     67
1       Samuel   20     56
2      Deborah   23     54
3       Ronald   29     89
4        Messi   18     91
5        Bruno   14     75
6        Rashy   16     46
7     Martinez   19     31
8        Light   30     34
9         Love   25     28
10    Emmanuel   24     47
11      Divine   31     86
12     Vincent   34     59
13       Grace   26     78
14       Glory   10     94
15    Precious   12     65
16   Priscilla   17     85
17   Francisca   21     81
18        Fred   35     79
19    Progress   36     44
20   Marvelous   40     41
21        Shaw   39     50
22       Dorgu   38     60
23       Silva   33     61
24    Daniella    9     77
25  Emmanuella   11     88
26     Gabriel   44     95
27      Arnold   42     66
28        Raya   41     82
29       Yamal   45     94

### Viewiing data

In [4]:
df.head() # Prints the first five rows
df.tail() # Prints the last five rows
df.shape # Prints the shape of the dataFrame
df.columns # Prints the columns head
df.info() # Prints the overall info of the table.
df.describe() # Statistical report of the table

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    30 non-null     object
 1   Age     30 non-null     int64
 2   Score   30 non-null     int64
dtypes: int64(2), object(1)
memory usage: 852.0+ bytes

             Age      Score
count  30.000000  30.000000
mean   26.566667  66.766667
std    11.156205  20.309134
min     9.000000  28.000000
25%    17.250000  51.000000
50%    25.500000  66.500000
75%    35.750000  84.250000
max    45.000000  95.000000

### Selecting Data

In [ ]:
# Selecting columns
df["Name"]
df[["Name", "Age", "Score" ]]

0         Daniel
1         Samuel
2        Deborah
3         Ronald
4          Messi
5          Bruno
6          Rashy
7       Martinez
8          Light
9           Love
10      Emmanuel
11        Divine
12       Vincent
13         Grace
14         Glory
15      Precious
16     Priscilla
17     Francisca
18          Fred
19      Progress
20     Marvelous
21          Shaw
22         Dorgu
23         Silva
24      Daniella
25    Emmanuella
26       Gabriel
27        Arnold
28          Raya
29         Yamal
Name: Name, dtype: object

          Name  Age  Score
0       Daniel   15     67
1       Samuel   20     56
2      Deborah   23     54
3       Ronald   29     89
4        Messi   18     91
5        Bruno   14     75
6        Rashy   16     46
7     Martinez   19     31
8        Light   30     34
9         Love   25     28
10    Emmanuel   24     47
11      Divine   31     86
12     Vincent   34     59
13       Grace   26     78
14       Glory   10     94
15    Precious   12     65
16   Priscilla   17     85
17   Francisca   21     81
18        Fred   35     79
19    Progress   36     44
20   Marvelous   40     41
21        Shaw   39     50
22       Dorgu   38     60
23       Silva   33     61
24    Daniella    9     77
25  Emmanuella   11     88
26     Gabriel   44     95
27      Arnold   42     66
28        Raya   41     82
29       Yamal   45     94

In [6]:
# Selecting Rows
print(df.loc[0, "Score"]) # loc is for custom index
print(df.iloc[1, 0]) # iloc is for original index


print(df.loc[2, "Age"])

67
Samuel
23

#### Filtering

In [7]:
print(df)

          Name  Age  Score
0       Daniel   15     67
1       Samuel   20     56
2      Deborah   23     54
3       Ronald   29     89
4        Messi   18     91
5        Bruno   14     75
6        Rashy   16     46
7     Martinez   19     31
8        Light   30     34
9         Love   25     28
10    Emmanuel   24     47
11      Divine   31     86
12     Vincent   34     59
13       Grace   26     78
14       Glory   10     94
15    Precious   12     65
16   Priscilla   17     85
17   Francisca   21     81
18        Fred   35     79
19    Progress   36     44
20   Marvelous   40     41
21        Shaw   39     50
22       Dorgu   38     60
23       Silva   33     61
24    Daniella    9     77
25  Emmanuella   11     88
26     Gabriel   44     95
27      Arnold   42     66
28        Raya   41     82
29       Yamal   45     94

In [20]:
print(df[df["Age"] > 30])

         Name  Age  Score
11     Divine   31     86
12    Vincent   34     59
18       Fred   35     79
19   Progress   36     44
20  Marvelous   40     41
21       Shaw   39     50
22      Dorgu   38     60
23      Silva   33     61
26    Gabriel   44     95
27     Arnold   42     66
28       Raya   41     82
29      Yamal   45     94

In [9]:
under_35= df[df["Age"] < 35]
print(under_35)

          Name  Age  Score
0       Daniel   15     67
1       Samuel   20     56
2      Deborah   23     54
3       Ronald   29     89
4        Messi   18     91
5        Bruno   14     75
6        Rashy   16     46
7     Martinez   19     31
8        Light   30     34
9         Love   25     28
10    Emmanuel   24     47
11      Divine   31     86
12     Vincent   34     59
13       Grace   26     78
14       Glory   10     94
15    Precious   12     65
16   Priscilla   17     85
17   Francisca   21     81
23       Silva   33     61
24    Daniella    9     77
25  Emmanuella   11     88

In [10]:
over_35 = df[df["Age"] > 35]
print(over_35)

         Name  Age  Score
19   Progress   36     44
20  Marvelous   40     41
21       Shaw   39     50
22      Dorgu   38     60
26    Gabriel   44     95
27     Arnold   42     66
28       Raya   41     82
29      Yamal   45     94

In [11]:
above_25 = df[df["Score"] > 25]
print(above_25)

          Name  Age  Score
0       Daniel   15     67
1       Samuel   20     56
2      Deborah   23     54
3       Ronald   29     89
4        Messi   18     91
5        Bruno   14     75
6        Rashy   16     46
7     Martinez   19     31
8        Light   30     34
9         Love   25     28
10    Emmanuel   24     47
11      Divine   31     86
12     Vincent   34     59
13       Grace   26     78
14       Glory   10     94
15    Precious   12     65
16   Priscilla   17     85
17   Francisca   21     81
18        Fred   35     79
19    Progress   36     44
20   Marvelous   40     41
21        Shaw   39     50
22       Dorgu   38     60
23       Silva   33     61
24    Daniella    9     77
25  Emmanuella   11     88
26     Gabriel   44     95
27      Arnold   42     66
28        Raya   41     82
29       Yamal   45     94

In [12]:
below_30_above_60 = df[(df["Age"]< 30) & (df["Score"]> 60)]
print(below_30_above_60)

          Name  Age  Score
0       Daniel   15     67
3       Ronald   29     89
4        Messi   18     91
5        Bruno   14     75
13       Grace   26     78
14       Glory   10     94
15    Precious   12     65
16   Priscilla   17     85
17   Francisca   21     81
24    Daniella    9     77
25  Emmanuella   11     88

In [13]:
below_18_below_50 = df[(df["Age"]< 18) & (df["Score"]< 50)]
print(below_18_below_50)

    Name  Age  Score
6  Rashy   16     46

In [14]:
below_29_above_65 = df[(df["Age"]< 29) & (df["Score"]> 65)]
print(below_29_above_65)

          Name  Age  Score
0       Daniel   15     67
4        Messi   18     91
5        Bruno   14     75
13       Grace   26     78
14       Glory   10     94
16   Priscilla   17     85
17   Francisca   21     81
24    Daniella    9     77
25  Emmanuella   11     88

In [15]:
above_36_above_78 = df[(df["Age"]> 36) & (df["Score"]> 78)]
print(above_36_above_78)

       Name  Age  Score
26  Gabriel   44     95
28     Raya   41     82
29    Yamal   45     94

In [16]:
above_32_below_67 = df[(df["Age"]> 32) & (df["Score"]< 67)]
print(above_32_below_67)

         Name  Age  Score
12    Vincent   34     59
19   Progress   36     44
20  Marvelous   40     41
21       Shaw   39     50
22      Dorgu   38     60
23      Silva   33     61
27     Arnold   42     66